test_case/dropletDeformation/structured/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


vertices
(
    (  0.0  0.0   0.0)
    (  2.0  0.0   0.0)
    (  2.0  1e-2  0.0)
    (  0.0  1e-2  0.0)
    (  0.0  0.0   2.0)
    (  2.0  0.0   2.0)
    (  2.0  1e-2  2.0)
    (  0.0  1e-2  2.0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 1 100) simpleGrading (1 1 1)
);

edges
(

);

boundary
(
    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 1 2 3)
        );
    }
    top
    {
        type patch;
        faces
        (
            (6 5 4 7)
        );
    }
    left
    {
        type symmetryPlane;
        faces
        (
           (0 3 7 4) 
        );
    }
    right
    {
        type patch; 
        faces
        (
           (2 1 5 6) 
        );
    }
    front
    {
        type empty;
        faces
        (
            (1 0 4 5)
        );
    }
    back
    {
        type empty;
        faces
        (
            (3 2 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
