test_case/dropletDeformation/structured/0/alpha.water.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField #codeStream
{
    codeInclude
    #{
          #include "fvCFD.H"
    #};

    codeOptions
    #{
          -I$(LIB_SRC)/finiteVolume/lnInclude \
          -I$(LIB_SRC)/meshTools/lnInclude
    #};

    code
    #{
        const IOdictionary& d = static_cast<const IOdictionary&>(dict);
        const fvMesh& mesh = refCast<const fvMesh>(d.db());
        scalarField alpha(mesh.nCells(), 0.);

        const double bb = 1.3;
        const double aa = sqrt(1.0/bb);
        forAll(alpha, i)
        {
            const scalar x = mesh.C()[i][0];
//            const scalar y = mesh.C()[i][1];
            const scalar z = mesh.C()[i][2];
//            const scalar r = pow(x/aa, 2) + pow(y/aa, 2) + pow(z/bb, 2);
            const scalar r = pow(x/aa, 2) + pow(z/bb, 2);
            
            scalar val = 0.5 * (1.0 - tanh((r - 1.0) / 0.1));

            alpha[i] = val;
        }

	     alpha.writeEntry("", os);
    #};   
};

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(right|top)"
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
