test_case/dropletDeformation/structured/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh

cp -r 0/alpha.water.org 0/alpha.water

runApplication $(getApplication)

runApplication foamToVTK


