test_case/dropletDeformation/structured/AllrunPar
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

cp -r 0/alpha.water.org 0/alpha.water

runApplication blockMesh

runApplication decomposePar

runParallel renumberMesh -overwrite

runParallel $(getApplication)

runApplication reconstructPar

runApplication foamToVTK


